Revit 2027 API
BoundaryConditions.IsValidPreset Method
 Checks whether the value set for boundary conditions preset is valid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidPreset(
	BoundaryConditionsPreset preset
)
Public Function IsValidPreset (
	preset As BoundaryConditionsPreset
) As Boolean
public:
bool IsValidPreset(
	BoundaryConditionsPreset preset
)
member IsValidPreset :
        preset : BoundaryConditionsPreset -> bool
Parameters
preset BoundaryConditionsPreset
 The value set to be verified.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace